# Напишите ваше решение
a = float(input("Введите число для возведения в степень: "))
n = int(input("Введите степень числа: "))

print("число", a, "в степени", n, "равно =", a ** n)