# Напишите ваше решение
a = int(input("введите число 1 :"))
b = int(input("введите число 2 :"))
c = int(input("введите число 3 :"))

list_ = (a, b, c)
print("минимальное введенное число =", min(list_))